{"config": [{"config": {"padding": "valid", "kernel_constraint": null, "dtype": "float32", "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "filters": 16, "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "kernel_constraint": null, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "filters": 16, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "valid", "kernel_constraint": null, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_3", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "kernel_constraint": null, "name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_4", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_3", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_4", "rate": 0.5, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}