{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "valid", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_1", "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_2", "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_3", "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_4", "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "axis": -1, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 512, "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1024, "trainable": true, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 10, "trainable": true, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.5"}