{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 28, 28, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Conv2D", "config": {"filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "name": "conv2d_2", "strides": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "name": "conv2d_3", "strides": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "name": "conv2d_4", "strides": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "center": true, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_4", "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true}}]}