{"backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "dtype": "float32", "filters": 16, "activity_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 16, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 32, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 32, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 512, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "relu", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 1024, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "relu", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 10, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "activation": "softmax", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}