{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "padding": "valid", "filters": 16, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_1", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "filters": 16, "kernel_constraint": null, "use_bias": true, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_2", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "filters": 32, "kernel_constraint": null, "use_bias": true, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_3", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "filters": 32, "kernel_constraint": null, "use_bias": true, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_4", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 512, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_3", "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1024, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "name": "dropout_4", "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 10, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}]}