{"keras_version": "2.1.5", "config": [{"config": {"padding": "valid", "filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_1", "center": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_2", "center": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"padding": "valid", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_3", "center": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "name": "batch_normalization_4", "center": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "units": 512, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "units": 1024, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "units": 10, "bias_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}