{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "conv2d_1", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "dense_1", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "name": "dense_2", "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "name": "dense_3", "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}]}