{"config": [{"config": {"bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "padding": "valid", "strides": [1, 1], "trainable": true, "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "use_bias": true, "filters": 16, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "trainable": true, "name": "batch_normalization_1", "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 16, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "trainable": true, "name": "batch_normalization_2", "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 32, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "trainable": true, "name": "batch_normalization_3", "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "conv2d_4", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 32, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "trainable": true, "name": "batch_normalization_4", "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "units": 512, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "units": 10, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential"}