{"config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "filters": 16, "batch_input_shape": [null, 28, 28, 1], "kernel_size": [3, 3], "dtype": "float32", "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "conv2d_4", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activity_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "activity_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null}}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}