{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "trainable": true, "name": "conv2d_1", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"scale": true, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 16, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"scale": true, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"scale": true, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"scale": true, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 512}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 1024}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 10}}]}