{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_1", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_2", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_3", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_4", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_3", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 1024, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "bias_constraint": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 10, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}], "backend": "tensorflow"}