{"backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "activation": "relu", "units": 784, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 784]}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "activation": "softmax", "units": 10, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}], "class_name": "Sequential", "keras_version": "2.1.5"}