{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 784, "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 784], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32", "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "name": "dense_2", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}