{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"kernel_regularizer": null, "batch_input_shape": [null, 1, 28, 28], "padding": "valid", "kernel_size": [5, 5], "dtype": "float32", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "name": "conv2d_1", "dilation_rate": [1, 1], "filters": 32, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 128, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 10, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}